import { Component, OnInit } from '@angular/core';
import {animate, state, style, transition, trigger} from '@angular/animations';



@Component({
  selector: 'app-price',
  templateUrl: './price.component.html',
  styleUrls: ['./price.component.css'],
  animations: [
	trigger('detailExpand', [
	  state('collapsed', style({height: '0px', minHeight: '0'})),
	  state('expanded', style({height: '*'})),
	  transition('expanded <=> collapsed', animate('225ms cubic-bezier(0.4, 0.0, 0.2, 1)')),
	]),
 ],
})
export class PriceComponent  {

	dataSource = priceData;
	columnsToDisplay = ['Позиція', 'Назва',  'Час','Ціна' ];
	columnsToDisplayWithExpand = [...this.columnsToDisplay, 'expand'];
	expandedElement: Element | null | undefined;
 }
 export interface Element {
	Назва: string;
	Позиція: number;
	Час: number;
  Ціна: number;
	description: string;
	imageSrc: string ;
	imageAlt: number;
 } 


 const priceData: Element[] = [
	{
		Позиція: 1,
	  Назва: 'АНТИЦЕЛЮЛІТНИЙ МАСАЖ',
	  Час: 50 , 
	  Ціна: 600 ,
	imageSrc: '/assets/img/foto7.jpg',
	  
	imageAlt: 1,
	
	  description: `Тривалість – 50 хв Ефективна боротьба з целюлітом Зменшення в обсязі від 3 см Робота з якісною косметикою Позбавлення від “Апельсинової кірки” Антицелюлітний масаж – це комплекс прийомів механічного або рефлекторного впливу на шкіру і підшкірно-жирову клітковину певними масажними прийомами. У процесі масажу поліпшується кровообіг у наслідку чого відновлюється правильне харчування клітин, що призводить до поліпшення обміну речовин між клітиною і міжклітинної рідиною. Правильно виконаний ручний антицелюлітний масаж сприяє усуненню жирових клітин і виведенню зайвої рідини.`,
	},
	{
		Позиція: 2,
		Назва: 'МЕДОВИЙ МАСАЖ',
		Час: 60, 
		Ціна: 650 ,
		imageSrc: '/assets/img/foto8.jpg',
	imageAlt: 1,

		
		description: `Можливість опрацювання окремих зон Робота з натуральними інгредієнтами Ефективна боротьба з целюлітом Медовий масаж від целюліту. Медовий масаж для схуднення – один з найкращих засобів, якщо Ви хочете отримати приголомшливий ефект, при цьому, не нашкодивши своєму здоров’ю. Забудьте про кардинальні і жорсткі дієти. Правильне харчування і спорт – це запорука приголомшливої фігури. Але якщо підшкірний жир дає про себе знати і неабияк Вас засмучує, медовий масаж тіла продемонструє справжні чудеса і усунення декількох сантиметрів в обсягах, що неможливо не помітити.`,
	 },
	{
		Позиція: 3,
		Назва: 'МАСАЖ ДЛЯ ВАГІТНИХ',
		Час: 60, 
		Ціна: 500 ,
		imageSrc:'/assets/img/foto3.jpg',
	imageAlt: 1,
		description: `Поліпшення лімфо і кровообігу Зменшення набряків Запобігання розтяжок Знижує появу варикозу.Вагітність - найрадісниший, значимий і дивовижний момент в житті кожної жінки. У цей час важливо подбати не тільки про здоров'я майбутнього малюка, але і про своє самопочуття, адже протягом всіх місяців очікування мама відчуває колосальне навантаження на організм. Як фізичне, так і психологічне. Це можуть бути болі в спині, тяжкість у ногах, набряклість, перепади настрою і навіть депресія.`,
	 },
	{
		Позиція: 4,
	  Назва: 'МАСАЖ СТОП',
	  Час: 20, 
	  Ціна: 400 ,
	  imageSrc: '/assets/img/foto4.jpg',
	imageAlt: 1,
	  description: `Зняття втоми в ногах Опрацювання біологічних точок Масаж ніг паличками Загальне поліпшення організму. Тайський масаж стопи – це процедура, яка дозволяє відновити безперешкодний потік енергії, а значить, дозволяє позбутися від недуг. Виконувати такий масаж повинен тільки професіонал. Згідно з відомостями східної медицини, саме на стопах знаходяться рефлексогенні зони, кожна з яких відповідає за той чи інший орган і системи організму. У Таїланді такий масаж для багатьох є обов’язковою щоденною процедурою.`,
	},
	{
		Позиція: 5,
	  Назва: 'ЛІМФОДРЕАЖНИЙ МАСАЖ ОБЛИЧЧЯ',
	  Час: 30, 
	  Ціна: 400 ,
	  imageSrc: '/assets/img/foto5.jpg',
	  imageAlt: 1,
	  description: `Опрацювання скул на обличчі Масаж лобної частини Усунення зморшок на обличчі Корекція овалу обличчя. Лімфодренажний масаж обличчя – стимулює відтік венозної крові і лімфатичної рідини, що сприятливо впливає на підшкірні структури. Після масажу обличчя кровообіг посилюється, клітини шкіри отримують необхідне для молодості кількість кисню, а виведення токсичних речовин в рази прискорюється.`,
	},
	{
		Позиція: 6,
	  Назва: 'КЛАСИЧНИЙ МАСАЖ',
	  Час: 30, 
	  Ціна: 600 ,
	  imageSrc: '/assets/img/foto6.jpg',
	imageAlt: 1,
	  description: `Застосовується при болях в спині Профілактика і лікування хребта Масаж при остеохондрозі Масаж спини для чоловіків і жінок. Масаж охоплює всю спину, але не враховує сегментарно-рефлекторних зв’язків. Він має рівномірний вплив на шкіру та м’язи. Спочатку підвищує тонус мускулатури, а потім її розслабляє.
	  Прийоми чергуються. Починають маніпуляцію з погладжування, потім переходять до розтирання, розминання, вібрації. Після кожної серії прийомів повертаються до погладжування.`,
	},

 ];
